Tekla.Structures.Internal.Channels
The Channels class creates .NET communication channels (currently IPC).

Tekla.Structures.Internal.Channels.RegisterChannel(System.String)
Registers a .NET remoting channel (currently IPC) with the given name.
ChannelName: The name of the channel.
Returns: True on success.